{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 1", "body": "Rishi Madhuchchhandah Vaishvamitrah's Mantra on Agni recited in Gayatri Chhand meter. "},
    {"tip": "Sanskrit", "body": "प्रथमं मण्डलमं, अनु १, प्रथमं सूक्तम् ऋषि मधुच्छन्दा वैश्वामित्रः छन्द: गायत्री अग्निः देव"},
    {"tip": "Notes", "body": "The author describes Agni's attributes in this hymn. Agni is most prominent deity in the Vedic hymns along with Indra. Studying this hymn reveals the secret of the Rig Veda. Rig Veda, Upanishads utilize the first hymn (or a phrase of the first mantra in the shorter Upanishads) to set the tone for the theme underlying the entire chapter or text. The first step in the Yoga practiced by the Rig Veda poets hovers around will-power development, which gives an insight into the higher realms. In the Rig Veda, Agni, the deity is the Seer-Will who lights up the flame along the path in achieving an all-around perfection, that includes physical riches, spiritual felicities that comes from sheer power of the will in the yajamana, human aspirant. This leads the aspirant to attain the higher powers. The first Sukta in the first book is a hymn of nine verses set in the Gayatri meter. A meter sets the mode on how to pronounce the syllables; three parts of eight syllables make a Gayatri meter."},
    {"tip": "Mantra 1.1.1", "body": "अग्निम् ई॑ळे पुरोहितं यज्ञस्य देवं ऋत्वि॒ज॑म् । होतारं रत्नधातमम ॥"},
    {"tip": "Transliterated", "body": "agnim iley purohitam yajnasya devam ritvijam; hotaram ratnadhatamam"},
    {"tip": "Translation", "body": "Agni I adore, placed with Ila initiates (1), the lord of yajna, rtvikor one who has the ecstasy of Truth (2). He, the summoning priest (3), activates (in human beings) the dormant ecstasies excellently (4)."},
    {"tip": "Word by word", "body": "agnim (agni - ang - strong and luminous) ईळे ile (Ila is Agni's consort, also means initiate) पुरःऽहितम purah-a-hitam (who leads, the herald) yajnasya (Lord of Yajna) devam (div - illumine) ऋत्विजम ritvijam (rit - truth, vi - ecstasy) hotaram (hotar special priest) (Sayana breaks it as ‘devenam yagyapu hotarnamak Ritvik-agnirave’) रत्नऽधातम ratna-a-dhatamam (ratna - treasure, ratnadha - bears the treasure, another meaning causes fame)."},
    {"tip": "Description", "body": "The essence of this prime mantra: * I aspire intensely for Agni, accompanied by Ila. Adorable is he, the leader who carries out the yajna. He does and gets done the yajna in due season. He, as the summoning priest, is capable of bringing the Gods to the yajna performed here. He establishes excellent felicities in the aspirant. * We notice in this Sukta, composed several millennia earlier, the seeds of the later Vedantic thought. For instance, in the yajna, Agni is himself the priest and Agni is also the deity called for. He actively helps the human aspirant in the march toward perfection. We see here the idea of, *worishipping the spirit by the spirit*, later developed extensively as the Yoga of Knowledge. For instance, Bhagavad Gita (4.24), states that, * Brahma, the supreme principle, is the offering in yajna, Brahma is the sacrificial fire, Brahma is the thing offered .… *agni*: It is derived from ang which indicates a strong and luminous movement. *iḷe*: Agni’s consort. Indicates an act of adoration, and aspiration. *purohitam*: There are two words here meaning *placed in front*. It is incorrect to equate it with the modern or classical priest or purohit, a person who directs the performance of rituals. Even in the times of the epic Ramayana, purohit meant the spiritual director of the king who not only advised the king on both temporal and spiritual matters, but also went ahead of the king in the procession (leader or placed in front) when the king wanted to meet other kings. (Ramayana, Balakanḍa, 69.4.5). In the esoteric sense, Agni is the Divine Will in a person who leads him/her towards the higher goals. Agni as the Divine Will is mentioned explicitly in (1.1.5) to be discussed presently. *deva*: Deity, a cosmic power endowed with Light; derived from div, to illumine. Deity is used here even though it may mislead the reader because of its sense in semitic religions. Deva-sin Veda are harmonious without any quarrels among them as in the Greek Gods. Deva-s are always beneficial to the human beings helping them to achieve overall perfection. *yajnasya devam*: Lord of the yajna. *Yajna* is the collaborative activity between the human aspirant and the cosmic powers, happening both in the subtle body of a person and the cosmos. It is the offering of all works and gains to the divinity inside. Through the right yajna a person can achieve perfection in all actions. An outward rite or ceremony is the physical symbol of this inner yajna. Agni is the Divine Will in a person who prompts him/her to do all the actions in a spirit of offering, churn the Delight out of all actions and offer it to the Gods. Agni makes the aspirant participate in the inner yajna, even if the person is unconscious of the divine presence in his/her surface activities. One school of traditionalists, mimamsaka-s, claim that yajna is nothing but the outward ritual and characterize Rig Veda Samhita and other Veda Samhita-s as part of Karma-Kanḍa, the ritual-book. However, out of the 1028 hymns in Rig Veda Samhita, not even one hymn gives details of any physical rite. In the text there are only words such as yajna, adhvara, yaja connected with rites. These words have spiritual meanings. *rtvik*: According to (Sri Aurobindo), rtvik is made of rt (Truth) and vi (ecstasy). Hence it is rendered as the one who has the ecstasy of Truth. Also, *rtu* in the Veda is the Order of the Truth, its arrangement of time, and circumstance. Agni is the representative cosmic power or priest who sacrifices according to the law, order, and season of the *ritam*. TIP - all actions are viewed as sacrificial. *hotaram*: summoning priest or one who invites all the deva-s or cosmic powers to the yajna in progress; *hotar* and its variants occur more than 200 times in Rig Veda. The traditional commentaries identify this word with the special priest, *hotar*, who offers the libation (*havis*). One of the meanings of the root *huin hotar* is to cry or shout. Agni calls the other Gods or Powers for helping the human aspirant in their respective ways. *ratnadhatamam*: *ratna* in Veda means happiness or ecstasy; rathnadha means one who bears the happiness. The suffix tam means excellent. The happiness is the fruit of the offerings of the Rishi or the aspirant in the yajna and Agni establishes the happiness in him/her. Only in later Sanskrit does ratna refer to jewels or wealth. The commentators, who view the yajna as a ritual of propitiation to the deities, render this Word as, *the donor of the cows and horses*."}
]}
