{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 1", "body": "Summary"},
    {"tip": "** ", "body": "Let me paraphrase each verse"},
    {"tip": "1 ", "body": "I adore Agni along with Ila placed in front (the prime mover), he the deva of the yajna, the invoker or the summoning priest in the yajna is the carrier of felicities."},
    {"tip": "2 ", "body": "Agni, adored by the ancient Seers, adorable even to later Seers. He brings here the deva-deities."},
    {"tip": "3 ", "body": "The treasure obtained from Agni is full of strength, calmness, happiness and other felicities; it increases day by day, not subject to dwindling like ordinary wealth."},
    {"tip": "4 ", "body": "Only the yajna, which is protected by Agni on all sides, reaches the deities."},
    {"tip": "5 ", "body": "He is endowed with the capacity to invoke super-normal powers of vision and audition in the human aspirants; he is wise and firms the will; Agni can make the other cosmic powers and the deities manifest in the aspirant. "},
    {"tip": "6 ", "body": "Agni's special Truth lies in his power to confer an auspicious delight (bhadra) which averts anything False."},
    {"tip": "7 ", "body": "We approach Agni everyday, even in the night and in the light, carrying (offering) our surrender by our thought. "},
    {"tip": "8 ", "body": "The (vast) Truth is the home of Agni. There he rise in strength (increases) to protect the human aspirant."},
    {"tip": "9 ", "body": "Agni, cling to us like a father to a son; give us an easy access."},
    {"tip": "*SAKSHI* ", "body": "Agni is not a mere flame or even the flame’s deity. He is a divine aspect whom the Rishi loves intensely. He develops a personal relationship like a child with a parent. Especially in the ninth verse, the poet approaches Agni like a father. The seventh verse indicates that the Rishi-s knew meditation techniques in directing thoughts. The idea of surrender is present in the hymn. The first verse merits careful attention. There is no mention of any ritual being performed. Agni carries out the functions of a priest, which are mainly psychological in character. If we study all the verses in Rig Veda where the word *kindling* occurs, we notice human beings do not kindle Agni, but the gods do, often as a pair, the solar powers, Mitra and Varuna. The Yajna in Rig Veda is not a mere rite. One unmistakably thinks the Rig Veda words as ritualistic words to atone spiritual practices and experiences. The third verse clearly indicates that the increasing opulence bestowed upon us by Agni everyday. Such is not tangible. The fourth verse regards yajna as a pilgrimage, which takes the inner being of the aspirant to the secret divinity inside. The fifth verse declares that Agni is the power of Divine Will endowed with wisdom and vision."},
    {"tip": "** ", "body": "The sixth verse reveals the special truth of Agni. He bestows the happiness (bhadra) endowed with goodness which discriminates between Truth and Falsehood. This interpretation of bhadra is inescapable if we study all the verses involving the word bhadra namely (5.82.4), (5.82.5), (4.19.20), (5.1.10), (10.25.1), (10.104.9) etc. "},
    {"tip": "** ", "body": "This Sukta contains several keywords of the Rig Veda such as satya (Truth), ritam (Right or Truth-in-Movement), rtvijam (one who performs the yajna in the right order and at the right time), hotaram (the summoning priest or one who calls the Gods), Rishi (the Seer), rayi (internal and external felicity), adhvara(the journey or the pilgrimage of yajna), kavi (the Seer), kratu(the divine will), bhadra,(auspicious happiness or happy-good), vardhamanam(increasing), sve dame(own home), etc. A proper understanding of these words goes a long way in understanding the secret of the entire Rig Veda."}

]}
