{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 31", "body": "Rishi Hiranyastupa Angiras's Mantra on Agni recited in Jagati Chhand meter. "},
    {"tip": "Sanskrit", "body": "प्रथमं मण्डलमं, अनु ७, ३१ सूक्तम् ऋषि: हरिण्यस्तुप आन्गिरासः छन्द: जगती अग्निः देव"},
    {"tip": "Mantra 1.31.4", "body": "त्वमग्ने मनवे द्यामवाशयः पुरूरवसे सुकृते सुकृत्तरः । श्वात्रेण यत्पित्रोर्मुच्यसे पर्या त्वा पूर्वमनयन्नापरं पुनः ॥ "},
    {"tip": "Transliterated", "body": "tvam agne manave dyam avasayah pururavase su-a-krte sukrt-a-tarah; svatrena yat pitroh mucyase pari aa tva purvam anayann aa aparam punah"},
    {"tip": "Translation", "body": "Agni, you have proclaimed to the thinker (1,3), that Heaven (can be attained) (2). To the performer of good actions who laments much (4), (you motivate him) to do good deeds (5). You were released by quick churning of Heaven and Earth (6); they brought you in front (and established you) (7), and from the rear (8)."},
    {"tip": "Word by word", "body": "tvam agne (you agni) manave (thinker) dyam avasayah (avasayah - sounded) pururavase (performing the Yajna) su-a-krte (meritorious) sukrt-a-tarah (wise); svatrena (churning) yat pitroh (pitro - father) mucyase (muchyase - released) pari (turn around) aa tva (you and I) purvam anayann (purva - past; ananyan - brought) aa aparam punah (again and again)"},
    {"tip": "Description", "body": "Agni has proclaimed that the divine station has to be attained and can be attained by the thinker. The person performing the yajna is called pururavas because he laments much about his efforts to attain the divine station or consciousness. To such a person, Agni is the superb motivator who pushes the sacrificer to greater heights. Sayanacharya introduces the story of the Puranic person, Pururavas, for which there is no need. Purana-s came into existence much later than the Veda.Agni is released all around by the parents (pitroh), the forces of consciousness denoted by Heaven and Earth. *muchyase*: released; they in line 7: heaven and earth; *avashayah*: sounded; Line 8: *a*: anayan, brought. *shvatrena*: churning;"}
]}
