{"data":[{"tip": "Side note", "body": "Is it just a coincidence?"},
{"tip":"* ", "body": "354 hymns or Suktas dominate the first four books of the Rig Veda corresponding to the precise number of days in a lunar year. The middle four books run 324 hymns equaling the Nakshatra, or lunar constellation year producing the total amount of hymns in the Rig Veda when multiplied by the value of PI. Half the number of hymn groups multiplied by108 equals the distance between the Sun and the Earth in solar diameters and the distance from the Moon to the Earth in lunar diameters."},
{"tip":"* ", "body": "Unfolding the precise nature of the Rig Veda reveals a helical coil of mathematical complexity with each layer describing deeper and more involved cycles of natural phenomenon providing a celestial key to follow the path of ancient events and wisdom challenging all modern conceptions of history."},
{"tip":"* ", "body": "Heliocentric and recursions dominate the core of the Rig Veda capturing the idea of gravity and encapsulating a foundational understanding of all nuclear and sub nuclear particles buried deep in the sacred hymns of the ancient Rishi."},
{"tip":"* ", "body": "A sophisticated knowledge of astronomy, philosophy, science and natural phenomenon only duplicated and understood today by the greatest computers and strongest minds available to modern science."},
{"tip":"* ", "body": "Based on an oral tradition stretching back to the dawn of mankind, the Rig Veda relies on a precise syllable count and a reliable sound structure based on the Gayatri meter consisting of three sections of eight syllables with the first four syllables free and the last four syllables in a fixed cadence, allowing the tale to unfold naturally like a blossoming lotus."},
{"tip":"* ", "body": "This precise sequence of sound from the start of the narration dictates the sequential progression of sound and silence initiating the dynamics of consciousness. The Rig Veda expands according to Prakritis or the eight fundamental qualities of intelligence after full consciousness."},
{"tip":"* ", "body": "The first eight syllables or Pada (pada meaning ‘the foot’ conveys a fraction) expresses the Rishi-quality of pure consciousness. The next eight syllables represent the eight Prakritis of Deva, continuing with the next Pada dedicated to Chhandas. Developing the last eight lines completes the first stanza and Prakritis exposing the mathematical sophistication of the Rig Veda. The first verse of the first stanza contains 24 syllables plus 24 silent spaces with 192 syllables in total equaling 240 which totals the number of vertices of a root vector polytype of E8 Lie Algebra, the most advanced mathematics and physics model known to modern man."},
{"tip":"* ", "body": "Exposing raw data from each successive layer of the Rig Veda taunts modern man with the wisdom of a forgotten ancient knowledge lost to modern society. An ancient book of mantra relying on the science of sound to expose logical mathematical progressions capable of defining the entire script while concealing the laws of nature and the true fabric of space and time deep within the multiple layers of construction."},
{"tip":"* ", "body": "The complex nature of the language in the Rig Veda conceals very specific astronomical properties, formations and events solidifying ancient dates for the text and magnifying calculable physical entities and properties shrouding accepted human history in mystery and controversy."}
]}
