{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 31", "body": "Rishi Hiranyastupa Angiras's Mantra on Agni recited in Jagati Chhand meter. "},
    {"tip": "Sanskrit", "body": "प्रथमं मण्डलमं, अनु ७, ३१ सूक्तम् ऋषि: हरिण्यस्तुप आन्गिरासः छन्द: जगती अग्निः देव"},
    {"tip": "Mantra 1.31.5", "body": "त्वमग्ने वृषभः पुष्टिवर्धन उद्यतस्रुचे भवसि श्रवाय्यः । य आहुतिं परि वेदा वषट्कृतिमेकायुरग्रे विश आविवाससि ॥ "},
    {"tip": "Transliterated", "body": "tvam agne vrsabhah pusti-a-vardhana udyata-a-sruce bhavasi sravayyah; yah aa-a-hutim pari veda vasat-a-krtim eka-a-ayuh agre visha aa-a-vivasasi."},
    {"tip": "Translation", "body": "Agni, you shower knowledge (1), and nourish (2). You are praised (with mantra-s) (4),by those with the luminous clarity of thought (3). O Sole One, first illumine the one (6,8),who offers on all sides, vashat along with knowledge (5), and (illumine) the others too (visha) (7)."},
    {"tip": "Word by word", "body": "tvam agne (you agni) vrsabhah (indra known as vrishabh, the bull) pusti-a-vardhana (pusti - prosperous; vardhana - increasing) udyata-a-sruce (one who pours the ghee) bhavasi (Bhava - deity, turning into) sravayyah; yah (proceed) aa-a-hutim (calling) pari (around) veda (knowledge) vasat-a-krtim eka-a-ayuh (vasat - offering) (ekayu - one, sole person) agre  visha (others) aa-a-vivasasi (not intended)"},
    {"tip": "Description", "body": "*vashat*: A word used extensively in rituals while making offerings. In the inner sacrifice, the use of this word while making the offering after the invocation gives the notion of firmness. The hymn states that Agni gives illumination to the persons who with vashat give offerings to the Gods. *ekayuh* :eka + ayu, the Sole Person. The word ayu is well known in Veda to mean a living being in general and a human in particular. Agni represents the soul or essence of the pranamaya kosha in all humans. Recall the second rik which states, ‘In how many ways do you dwell in man? *udyatasruche*: for the ritualists it is ‘one who lifts the ladle to pour ghee.’ In the esoteric sense it signifies the person with luminous clarity of thought. *vrshabha*: One who gives or showers all the knowledge and power; it is a popular word in the Rigveda occurring with its inflections and variants more than 200 times. It is a common epithet for Indra. The common meaning - bull, is applicable only in a few instances. It is also a common epithet used to describe the might of kings, *purusha vrshabha*."}
]}
