{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 1", 
    "body": "Rishi Madhuchchhandah Vaishvamitrah's Mantra on Agni recited in Gayatri Chhand meter. "},
    {"tip": "Sanskrit", "body": "प्रथमं मण्डलमं, अनु १, प्रथमं सूक्तम् ऋषि मधुच्छन्दा वैश्वामित्रः छन्द: गायत्री अग्निः देव"},
    {"tip": "Mantra 1.1.6", "body": "यदङग दाशुषे तवमग्ने भद्रं करिष्यसि । तवेत तत सत्यमङगिरः ॥ "},
    {"tip": "Transliteration", "body": "yadhadanga dasusey tvamagney bhadram karisyasi; tavet tat satyam-angirah."},
    {"tip": "Translation", "body": "The auspicious delight (bhadra) you generate (2), for the giver, Agni (1), that’s the real truth of you, Angiras (3)."},
    {"tip": "Word by word", "body": "यत अङ्ग yat (wherein) - adanga (of ang, of angiras) dasusey (giver) tvam agney (you Agni) bhadram (blessings, happiness) karisyasi (create) tava it tat(that) satyam angirah (truth O angiras)"},
    {"tip": "Description", "body": "*anga, angiras*: These epithets of Agni indicate the quality of pre-eminence, flaming or glowing. *dashushe*: giver. The person who performs the yajna gives offerings and hence is called the *giver*. He gives not only material gifts but also the results of his actions and enjoyments to the appropriate cosmic powers. *yajna* is an arrangement for the distribution of the activities. *bhadra*: It is a keyword in the Veda. Griffith translates it as blessings. According to Sayanacharya, it signifies wealth in the form of progeny, animals, etc. *Bhadra* and its variants occur more than one hundred times in the Rig Veda and its precise meaning can be grasped by studying all these mantra-s. Such a study has been done in [Kapali Sastry, Collected Works, Vol.4]. The present mantra states that *bhadra* is the auspicious happiness that Agni creates for the one making the sacrifice or the human aspirant and that is the Truth of Agni alone. What could that Truth be? In many mantra-s, bhadra is used as something exalted connected with Truth in contradistinction to the evil and calamities associated with false knowledge. For instance, Rig Veda (5.82.5) declares, *Savitr, send far away all calamities, send us only what is bhadra, good*. Bhadra is used as a power of Truth (Satya), which opposes all the misfortunes arising out of evil and false knowledge signified by *Nirriti*. In Rig Veda (10.164.2), *bhadra* is used to ward off the effects of evil dream, *bhadra* or *auspicious happiness do they elect*. Bhadra is used as an adjective to signify Agni's own home: *vast, great and happy, bhadra, is your house of refuge*, Rig Veda (5.1.10).  *Bhadra* is frequently used as an adjective for mind, *Send us a happy mind, bhadram mano*, RIG VEDA (10.25.1). This mantra, RIG VEDA (1.1.6), states that this bhadra is Agni's truth alone. *Bhadra* confers both happiness and spiritual Good and hence is called here as auspicious happiness. Note that what is pleasing may not necessarily bring us near to the Spirit. Recall the distinction made in Katha U. (1.2.2) between shreyas,the good and preyas,the pleasing,which yields only momentary happiness. Bhadra has the same connotation as shreyas."}
]}
