{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 1", 
    "body": "Rishi Madhuchchhandah Vaishvamitrah's Mantra on Agni recited in Gayatri Chhand meter. "},
    {"tip": "Sanskrit", "body": "प्रथमं मण्डलमं, अनु १, प्रथमं सूक्तम् ऋषि मधुच्छन्दा वैश्वामित्रः छन्द: गायत्री अग्निः देव"},
    {"tip": "Mantra 1.1.5", "body": "अग्निर्होता कविक्रतुः सत्य अश्चित्रश्रवस्तमः । देवो देवेभिरा गमत ॥"},
    {"tip": "Transliteration", "body": "aghnirhota kavi-a-kratuh satya aschitra-sravahastamah; devo devebhira gamat"},
    {"tip": "Translation", "body": "Agni, the summoning priest, the seer-poet-will, the deity, is the Truth (1); he possesses the power to grant super-normal powers of audition to the aspirant (2). May he arrive with the gods (3)."},
    {"tip": "Word by word", "body": "aghnih hota (agni, priest that summons) kavi-a-kratuh (kavi - seer, unlike classical Sanskrit, kavi means a visionary, akratuh - intelligence, wisdom, vision) satyah (truth in knowledge) chitra-sravah-a-tamah (chitra - manifold variety, sravas - hearing; tamah - darkness) devo devebhi (gods) aa gamat (arrive)"},
    {"tip": "Description", "body": "*kavi*: Poet Seer. This keyword with its variants occurs more than two hundred fifty times. kavi in classical Sanskrit means a poet, but in the Veda it denotes a Poet-Seer, one who sees beyond the realm of senses (kranta-darishi). *Kavi* is open to the action of felicities of inspiration, intuition, revelation and audition. This meaning is consistent with the meanings of related words like akavior kavya. A kavi occurs in Rig Veda (7.4.4) where it can only mean, *one without vision*, the prefix *a* denoting negation. The word kavya occurs about fifty times in the Rig Veda and the generally-held meaning, *literary composition* is inappropriate. The correct meaning for kavya is Seer-wisdom, the wisdom revealed by supra-physical visions or auditions. For instance, Rig Veda (10.87.21) reads, *protect us by your Seer-wisdom, (kavyena)*. An ordinary literary composition or poetry is not endowed with any power of protection. Rig Veda (4.3.16) states, *nivachana kavaye kavyani*, Seer’s wisdom utters the inner meaning to the Seer. Only the supra-physical Seer-wisdom has the power of protection and the secret inner meaning. Rig Veda (8.79.1) defines the Rishi as a sage (vipra) who has the revelation of a mantra (kavyena). *kratuh*: It is incorrectly interpreted by ritualists as intelligence, act or sacrifice. In the esoteric interpretation, it is given the fixed meaning of, *unshakable or a determined conscious force capable of execution*. *Kratuh* is the will associated with wisdom or vision and the force, which makes its execution possible. The related Word *sukratum* occurs ten times in the Rig Veda and it means *strength of will* as in Rig Veda (8.19.3). In addition, the word *kratuh* occurs in the Upanishads. For instance, in the Sandilya Vidya of the Chandogya Upanishad. (III.14), there is the phrase *sakratum kurvita* which is interpreted by the great commentator Sri Shankara as, *he should make the resolve or he should make up his will*. *kavikratuh*: This word, which occurs about ten times in the Rig Veda as an epithet for the deity Agni, has the meaning *Seer-will*. Thus, Agni is the Divine Will who has not only the vision of supra-sensible realms, but is also endowed with the force to manifest that vision of perfection in the worlds within us and without. Since the knowledge comes by Truth-Consciousness, there is no possibility either of misapplication or error in Agni's actions. *satya*:Truth of the Divine Being; True in knowledge. This Word and its variants occur two hundred times. See (1.1.8) for the distinction between Satya and ritam. *shravas*: power of supra-sensual audition or hearing. The Word *chitra* indicates an infinite variety and *tamah* indicates excellence. Thus, satyash-chitra-shravas-tamah means that Agni whose audition is suprasensible and is of many types can make the seeker hear wonderful audition. Obviously, Agni can be contacted by lauds and chants. Recall that the first mantra began with the phrase *agnim iḷe*, *adore Agni.* If Agni were a mere physical fire, contacting him through chanting would not make much sense."}
]}
