{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 2", "body": "Rishi Madhuchandaa Mantra on Vayu, Indra, Mitra and Varuna recited in Gayatri meter. "},
    {"tip": "Sanskrit", "body": "ऋषि मधुच्छन्दा वैश्वामित्रः छन्द: गायत्री देवता वायुः १-३ इन्द्रवायू ४-६ मित्रावरुणौ ७-९"},
    {"tip": "Mantra 1.2.1 - 1.2.9", "body": ""},
    {"tip": "1.2.1", "body": "वायवा याहि दर्शतेमे सोमा अरंकृताः । तेषां पाहि ऋधी हवम ॥"},
    {"tip": "1.2.2", "body": "वाय उक्थेभिर्जरन्ते तवामच्छा जरितारः । सुतसोमा अहर्विदः ॥ "},
    {"tip": "1.2.3", "body": "वायो तव प्रपृअ्न्चती धेना जिगाति दाशुषे । उरूची सोमपीतये ॥ "},
    {"tip": "1.2.4", "body": "इन्द्रवायू इमे सुता उप प्रयोभिरा गतम । इन्दवो वामुशन्ति हि ॥ "},
    {"tip": "1.2.5", "body": "वायविन्द्रश्च चेतथः सुतानां वाजिनीवसू । तावा यातमुप द्रवत ॥ "},
    {"tip": "1.2.6", "body": "वायविन्द्रश्च सुन्वत आ यातमुप निष्कृतम । मक्ष्वि त्था धिया नरा ॥ "},
    {"tip": "1.2.7", "body": "मित्रं हुवे पूतदक्षं वरुणं च रिशादसम । धियं धृताचीं साधन्ता ॥ "},
    {"tip": "1.2.8", "body": "ऋतेन मित्रावरुणाव रतावृधाव रतस्पृशा । क्रतुं बृहन्तमाशाथे ॥ "},
    {"tip": "1.2.9", "body": "कवी नो मित्रावरुणा तुविजाता उरुक्षया । दक्षं दधाते अपसम ॥"},
    {"tip": "Translation", "body": ""},
    {"tip": "1.2.1", "body": "Handsome Vayu, Your presence, we desire; The Soma mix sits pure, its ready; Hear our call, may they inspire"},
    {"tip": "1.2.2", "body": "O Vayu, with their chants; They extol you, many a lover; They turn to you with praises; Soma-apothecary1, you knew the light forever "},
    {"tip": "1.2.3", "body": "Vayu, while you filled this stream with speech; Close to the seeker it emits; Wide flows the Soma’s reach"},
    {"tip": "1.2.4", "body": "Indra-Vayu, Here’s the Soma squash, prepared with care. Walk with gifts that please; Delightful Soma, nourishes you everywhere."},
    {"tip": "1.2.5", "body": "Vayu and Indra, shortages you have none; Know this Soma squash; Come to us on a run"},
    {"tip": "1.2.6", "body": "Vayu and Indra, the Soma-apothecary has the perfect gift; Arrive soon, O leaders, disclose to us; knowledge of the right"},
    {"tip": "1.2.7", "body": "Pave the way to wisdom; Compassionate Mitra, you, we beckon; Rescind those that hurt us; Varuna, you, we summon."}, 
    {"tip": "1.2.8", "body": "Stir the truth-expression, O Mitra and Varuna; Truth in your clench, you can feel; Vast is your power of will; Now the truth, make it good, make it real."},
    {"tip": "1.2.9", "body": "Seer-poets, Mitra, Varuna, in so many ways, born divine ; Dwelling in the wide, endorse they, the astute intellect, in activity of mine. "},
    {"tip": "Word by word", "body": ""},
    {"tip": "1.2.1", "body": "vayo aa yahi (vayu a yahi - come near, presence is desired) darsat imey (darsata - beautiful, handsome, ime - these) somah (soma) aram-a-kritah (prepared, ready for you); tesam (of all of them) pahi (please drink) srudhi (listen, hear - the gods hear our call) havam (call, invocation)"},
    {"tip": "1.2.2", "body": "vaya (vayu iti) (O vayu) उक्थेभिः ukthebhih jarante (uktebhi - lauds, jarante - address) tvam (you) acha jaritarah (a synonym of a singer, an invoker who pines for the deity); sut-a-soma (Sayan - abhiputen soumenopeta) (persons who press or release the Soma) अहःऽविदः ahah-a-vidah (knowers of the Day or Light (ahah))"},
    {"tip": "1.2.3", "body": "vayo (vayu iti) (O vayu) tava (your) pra-a-pranchati (instrument that brings you near, stream that fills) dhena (synonym of speech) jighati (giver) dasuse (who serves the gods); uruchi (far reaching) soma-a-pitaye (pitaye - for sake of drinking / widens to drink soma)"},
    {"tip": "1.2.4", "body": "indravayu (indravayu iti) (O indra and vayu) ime (these) sutah (sutau - preparations of Soma) upa (near) praya-a-bhi (prayobhi - with dainties; prayobhi - gifts) aa gatam (a gatam - come over); indavh (drops) vam usanti (vam - you both; usanti - long for) hi (verily)"},
    {"tip": "1.2.5", "body": "vayo indrah ca (vayu iti indra cha) (vayu, indra - cha - as well) chetathah (aware of that) sutanam (libations of Soma) vajini-a-vasu (rich in horses, who have in plenty; vaja means plenty); tau (libations) aa yatam upa (yatam upa) (yatam-upa: both come near) dravat (quickly)"},
    {"tip": "1.2.6", "body": "vayo indrah ca (vayu iti indra cha) (vayu, indra - cha - as well) sunvatah (offerer of Soma) aa yatam upa (ya-yatam-upa: both come near) ni-a-kritam (nih akritam) (place appointed, also means fully accomplished); maksu ittha (makshu ittha) (makshu - come soon) dhiya (itta dhiya - and willingly) nara (heroes)"},
    {"tip": "1.2.7", "body": "mitram (mitra) huve (invoke) puta-a-daksam (puta-pure, daksam - strength (of will)) varunam (Varuna) ca (as well) risadasam (devour the enemies); dhiyam (prayer of knowledge) ghritachim (ghee - clarified butter, achim - in abundance; luminous clarity as from light) sadhanta (accomplish or complete)"},
    {"tip": "1.2.8", "body": "ritena (divine law, principles) mitra-varunau (mitra and Varuna) rit-a-vridhau (vridhau - increase; rita - truth) rit-a-sparsa (rita - truth; sparsa - connected); kratum (intelligently enlightened) brihantam asathe (brihantam - great, vast; asathe - obtained)"},
    {"tip": "1.2.9", "body": "kavi (kavi - wise, seer) nah (our) mitra-varuna (mitra and Varuna) tuvi-a-ajatau (tuvi-jata - powerful nature; tuvi also means many; tuvi-jata could mean - born in many ways) uru-a-aksaya (space abodes, uru means wide or spread out); daksam (strong) dadhant (render) apasam (act of sacrifice)"},
    {"tip": "Notes (SAKSHI) 1", "body": "The Rig Veda Samhita hymns are arranged such that the first three or four hymns serve as a summary to the entire text. Hymn 1.1 indicates the goal of the yajna in attaining Truth and Supreme beatitude. Hymns 1.2 and 1.3 introduce the deities Vayu, Indra, Ashvins, Mitra, Varuna and Sarasvati and the collective of gods, their profession, how they culture the body and the mind making it fit to bear the Agni pressure of the work and enjoy the delight of Soma. This hymn has three sub-hymns addressed to the deities Vayu, Indra-Vayu and Mitra-Varuna, three riks - each. In the first sub-hymn, the singer activates Soma or the delight of existence by acts of yajamanaand. He turns Soma pure by the declaration, it is not mine. Soma, the delight of existence in the nervous regions (or vital system) comes from the lord of the vital system, Vayu. The singer lauds Vayu in the first three riks. Then he prepares the mental plane where he lauds Indra and Vayu jointly."},
    {"tip": "Notes (SAKSHI) 2", "body": "As the singer moves to the third sub-hymn, he cultivates the mental aspects so that rita, or truth can manifest. The singer lauds Mitra and Varuna capable of establishing luminous intelligence in our subtle bodies. Vayu: (1.2.1 -1.2.3) Vayu is the lord of life-energies, he inspires the breath taking action (or the dynamic energy called Prana). He is also known as Mataarisvan since he breathes or acts (shava) in the mid region (matari). He supports the organization of the nerve channels and the chakra-s mentioned in tantric books and their activities in human beings, the basis of the mental energies. See also the introduction to (1.2.4-1.2.6). All the mantra-s address Soma."},
    {"tip": "Notes (SAKSHI) 3", "body": "Soma is the distilled essence (delight) of all experiences (sarvam anubhuti rasam). It marks the delight of existence, Ananda, whose home is rita-chit,Truth-consciousness. The singer produces Soma juice from a Soma-creeper in the rituals. It is an external symbol or icon of the eternal Soma. The Soma as essence of Delight, the rasa, remains hidden in the sense objects and sense experiences, in the plants and growths of the Earth-nature. By his actions, the sacrificer extracts the rasa or the Delight in the experience of the sense objects, purifies them and offers them to the Gods. Purification means divesting these actions or experiences from any personal claim. This purified Soma is the food of the Gods. Indra and other Gods are energized by this Soma and conquer the realms of in conscience controlled by the titans who cover the knowledge. We may recall the Bhagavad Gita verse (15-13) Becoming the Godhead of Soma, full of rasa (the sap in the Earth-mother), I nourish all the plants and herbs.' The classic book on ancient Indian herbs is the Sushruta Samhita and it describes twenty-four varieties of the Soma plant in its Chapter 27. But nowhere is its intoxicating property mentioned [Kapali Sastry, Collected Works, vol. 4, p. 169]. It is only the modern imaginative minds who assume that Soma is an intoxicating beverage and that the Seers, intoxicated with the Soma drink, laud the deity. Even a casual perusal of all the hymns on Soma will indicate its symbolic character. We will quote here a verse on Soma from RIG VEDA (10.85.3): One thinks one has sipped Soma, after one has crushed the herb; None ever drank of the Soma, known to the men of wisdom. Another quotation from RIG VEDA (8.79.2): He clothes the naked, doctors the sick, By his grace, the blind see and the lame walk. arankrtah:the word alam or aramhas 2 meanings: a sense of satiation and a sense of decoration or purification. In this context, purifying is appropriate - divesting it of all personal claims."}
]}
