{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 31", "body": "Rishi Hiranyastupa Angiras's Mantra on Agni recited in Jagati Chhand meter. "},
    {"tip": "Sanskrit", "body": "प्रथमं मण्डलमं, अनु ७, ३१ सूक्तम् ऋषि: हरिण्यस्तुप आन्गिरासः छन्द: जगती अग्निः देव"},
    {"tip": "Mantra 1.31.7", "body": "त्वं तमग्ने अमृतत्व उत्तमे मर्तं दधासि श्रवसे दिवे दिवे । यस्तातृषाण उभयाय जन्मने मयः कृणोषि प्रय आ च सूरये ॥ "},
    {"tip": "Transliterated", "body": "tvam tam agne amrta-a-tve ut-a-tame martam dadhasi sravase dive-a-dive; yah tatrsanah ubhayaya janmane mayah krnosi prayaah aa ca suraye."},
    {"tip": "Translation", "body": "You establish a mortal in the excellent of law of immortality (1), listening to the divine inspiration daily, O Agni (2). For the wise who thirst for two-fold lives (3), you instill happiness and pleasure (4)."},
    {"tip": "Word by word", "body": "tvam (you) tam agne (him, agni) amrta-a-tve (amrita - defying death) ut-a-tame (splendid) martam (mortal, earth) dadhasi (hold) sravase (sayan - food; kapila sastry - inspiration or divine hearing) dive-a-dive (day by day); yah tatrsanah (deposit) ubhayaya (two) janmane (origin) mayah (deceptive) krnosi (hurt or injure) prayaah (perhaps) aa ca (also) suraye (find fault)"},
    {"tip": "Description", "body": "*janmane ubhayaya*: two-fold birth; refers to the human and divine birth, i.e., the birth of Gods in man. *prayas*: all things pleasing. Note that the Vedic Seers do not espouse asceticism. Sayanacharya translates shravaseas food andubhayayaas getting bipeds and quadrupeds, meaning sons and animals. Sayanacharya assigns different meanings to shravase in different places. Kapali Sastry translates *shravase* everywhere as inspiration or Divine Hearing. *amrtatva*: immortality; The Vedic amrta, the immortality is a state of consciousness characterized by complete Light and Knowledge. Our ordinary consciousness is *mrta*, or mortal. Death, for the Vedic mystics, is not a simplistic affair beginning with the stoppage of heart. It is possible to establish ourselves in a state of consciousness of Light and Knowledge, so that we are not controlled by decay or death. Persons who have attained this state of consciousness can give up their bodies as per their wish. By becoming conscious of our source above in the world of Truth, we do not forfeit our right to live on earth a life of fulfillment. For those aspiring both for heaven and earth, Agni founds them both the divine bliss and human joy. in some history books that persons associated with the Rig Veda known as Aryas were nomads, has no factual basis whatsoever. There are several names signifying different types of boats or ships such as *vavuta*, *yanapatra* and others, indicating their widespread maritime activities. *ati parshat*: to lead, to carry beyond. Occurs in (3.20.4), (10.187.1) with this meaning (Sri Aurobindo). *durganiati parshatis* translated here as lead to happiness free of grief or overcoming all the states of grief.' Bhattabhaskara translates it as protection. Sayanacharya, strangely, translates it as destruction. But the overall meaning is not effected. *aratiyatah*: psychological foes on the inner plane. For Bhattabhaskara, the foes are both external and internal like passions and impulses. *durgani*: states of grief difficult to overcome. Bhattabhaskara translates it as difficulties. The Goddess Durga is commonly interpreted as one difficult (durga) to attain, or one, who overcomes all difficulties for the devotee.1.189."}
]}
