{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 1", 
    "body": "Rishi Madhuchchhandah Vaishvamitrah's Mantra on Agni recited in Gayatri Chhand meter. "},
    {"tip": "Sanskrit", "body": "प्रथमं मण्डलमं, अनु १, प्रथमं सूक्तम् ऋषि मधुच्छन्दा वैश्वामित्रः छन्द: गायत्री अग्निः देव"},
    {"tip": "Mantra 1.1.4", "body": "अग्ने यं यज्ञमध्वरं विश्वतः परिभूरसि । स इद् देवेषु गच्छति ॥ "},
    {"tip": "Transliteration", "body": "agne yam yajnam adhvaram visvatah pari-abhuh-asi; sa ida deveshu gachhati. "},
    {"tip": "Translation", "body": "Agni, the yajna-pilgrimage (1), surrounded by you from all sides (2), reaches the Gods (3) - such is the boon."},
    {"tip": "Word by word", "body": "agne (agni) yam (whom) yajnam (yajna) adhvaram (pilgrimage) visvatah (in all directions) pari-abhuh asi (surrounded on all sides) sah (that) it deveshu (the god) gachhati (he goes to)"},
    {"tip": "Description", "body": "*yajnam adhvaram*: *yajna* means the pilgrimage. Agni gives the path of ascent to the Rishi or the aspirant. The yajna or sacrifice is viewed in the Veda as a pilgrimage or a sacred journey that begins with our material body, the destination being svar, which is the Heaven or the habitation of the Gods. The concept of svarhas a counterpart in the inner body of the yajamana. The human aspirant joyously gives all he has in the yajna to attain the condition, svar. In such an endeavor there will always be adverse forces, which can be overcome only by Agni who insures that the attempt to reach the inner world of Gods will be successful. So in the esoteric interpretation, the word adhvara has a fixed meaning of journey or pilgrimage throughout the Veda. Agni is said to be the guide or charioteer of this journey in (1.44.2). In the traditional commentaries however, the word is given different meanings such as journey, free from harm, free of killing, etc., in different mantra-s.adhvara: gives or makes the path for *yajamana; adhva*: path; ra:to give. *varam*: is a boon."}
]}
