{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 1", "body": "Rishi Madhuchchhandah Vaishvamitrah's Mantra on Agni recited in Gayatri Chhand meter. "},
    {"tip": "Sanskrit", "body": "प्रथमं मण्डलमं, अनु १, प्रथमं सूक्तम् ऋषि मधुच्छन्दा वैश्वामित्रः छन्द: गायत्री अग्निः देव"},
    {"tip": "Mantra 1.1.2", "body": "अग्निः पूर्वेभिऋषिभिरीड्यो नूतनैरुत । स देवाँ एह वक्षति ॥ "},
    {"tip": "Transliteration", "body": "agnih, purvebhi-rishi-a-bhi-idyah nutanairuta; sa devaum yeh vaksati"},
    {"tip": "Translation", "body": "Agni, adored by the ancient seers (1), is adored by the new sages too (2). He brings the deities here (3)."},
    {"tip": "Word by word", "body": "agnih (O agni) पूर्वेभिः purvehbhi ऋषिऽभिः rishi-a-bhi ईडयः idyah (purvabhih - past, ancient rishi - seer, iha - here, hridyo - dear to heart) (Sayana breaks it as purvabhi rishi-abhi eedaya - purva dhatu (earth)) नूतनैः nutanaih उत uta (nutanay - new, utta - above the rest) सः sah (that) देवान् आ इह devan aa iha (deva - god) vaksati (brings)."},
    {"tip": "Details", "body": "*rishi*, the seer, one who has found the divine Word of the supra-intellectual, supra-mental spiritual Truth expressed in the form of *rik*, the *mantric verse*. The person is not an intellectual composer of the hymn, but the Seer (*drashta*) of the Eternal Truth; the impersonal knowledge comes to him/her vibrating out of the Infinite. Since the person has the complete inner knowledge, he/she can guide the world humanly as God guides it divinely. *purvebhih*: ancient. It is impossible to determine the age of these Seers, who are labeled ancient by the Seer Madhuchchhandas. The phrase indicates Agni was worshiped from a long time back. The reference to, *the ancient and modern Seers* is in other hymns like (8.11.10). *iha*: here (in the present location / time). The word is often misinterpreted to mean the Vedic altar in the house of the Rishi. Iha means our world, this Earth or in the esoteric interpretation, the inner body of the person who conducts the sacrifice. *a + vakshati*: brings. The function indicated here is a continuation of the one indicated in the epithet *hotar* (summoning priest) in (1.1.1); Agni brings the deities from Heaven to a location on Earth - the human aspirant."}
]}
