{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 189", "body": "Rishi Agastya Maitriavani Mantra on Agni recited in Trishtup meter. "},
    {"tip": "Sanskrit", "body": "प्रथमं मण्डलमं, अनु २४, १८९ सूक्तम् ऋषि:  अगस्त्यः मैत्रावरुणिः छन्द: त्रिष्टुपः अग्निः देव"},
    {"tip": "Mantra 1.189.1 - 1.189.8", "body": ""},

    {"tip": "1.189.1", "body": "अग्ने नय सुपथा राये अस्मान विश्वानि देव वयुनानि विद्वान । युयोध्यस्मज्जुहुराणमेनो भूयिष्ठां ते नमौक्तिंविधेम ॥"},
    {"tip": "Transliteration", "body": "agne naye su-a-patha raye asman visvani deva vayunani vidvan; yuyodhi asmat juhuranam enah bhuyistham te namah-a-uktim vidhem."},
    {"tip": "Notes", "body": "Found in Isha Upanishad and recited during funerals. Also in Yajur Veda and Brihadaryanka Upanishad"},
    {"tip": "Translation", "body": "Fire, lead us by a virtuous path to blessedness; All will manifest - that's what you teach; Take away the devious attraction to the wicked; To you, is our total surrender of speech"},
    {"tip": "Details", "body": "SAKSHI: (Sri Aurobindo)[yuyodhi: remove; eno: sin;juhuranam: devious attraction; dealing crookedly, (10.12.5); This verse in Isha U. (18) is recited during funeral rites. However in the inner yajna, it is a prayer to Agni to lead our subtle body to the higher planes. Clearly the line, remove from us the devious attraction of sin, is to be uttered by a person for his continuous growth, not merely on his behalf at the time of death. It is repeated in Krishna Yajur Veda TS (1.1.14.9), TS (1.4.43.3) and TS (4.2.11.11), Shukla Yajur Veda VS (5.36), VS (7.83) & VS (40.16), and Brh. U. (5.15.1)]"},
    {"tip": "Word by word", "body": "agne (agni) naye (new) su-a-patha (supath - good road) raye (raye - prince) asman (summon, call) visvani (dear to all men) deva (deity) vayunani (vayu) vidvan (intelligent); yuyodhi (yuyodhi - remove, detach) asmat (I) juhuranam (fire, sacrificing priest) enah (ena - this) bhuyistham (mostly, chiefly) te (you) namah-a-uktim (nama - salutaions; uktim - repeat) vidhem (kindled)"},
    
    {"tip": "1.189.2", "body": "अग्ने त्वं पारया नव्यो अस्मान सवस्तिभिरति दुर्गाणि विश्वा । पुश्च पृथ्वी बहुला न उर्वि भवा तोकाय तनयाय शं योः ॥"},
    {"tip": "Transliteration", "body": "agne tvam paray navyah asman (summon, call) svasti-a-bhih (svasthi - blissful) ati duh-a-gani (durga) visva (visva - global); puh ca (pu - dwelling; cha - and) prthvi (broad) bahula (felicities) nah (our) urvi (wide) bhava (bhava - deity) tokaya (represent a new born, child, wild boar) tanayaya (daughter) sam (together) yoh (they)"},
    {"tip": "Notes", "body": "Part of Durga Sukta and Mahanarayanh Upanishad"},
    {"tip": "Translation", "body": "Praise you fire, you lead us to the state of bliss; Beyond all trouble, with no effort; Suggest to us a wide, joyous home where we can stay; Grant our children, peace and comfort "},
    {"tip": "Details", "body": "SAKSHI: [This is a part of Durga Sukta in the Mahanarayana U. (2.3); Sayanacharya. renders tanayaas daughter. shamyohmeans all-pervading joy, both during rest and action; it is made of sham (joy or bliss) and yoh(well-doing or doing all actions with joy).navya: worthy of praise; svasti: blissful state;urvi:wide;prthvi: broad;pu: dwelling; bahuḷa: felicities;]"},
    {"tip": "Word by word", "body": "agne (agni) tvam (tvam - you) paray (parayati - carry over across) navyah (navya - worthy of praise) asman (summon, call) svasti-a-bhih (svasthi - blissful) ati duh-a-gani (durga) visva (visva - global); puh ca (pu - dwelling; cha - and) prthvi (broad) bahula (felicities) nah (our) urvi (wide) bhava (bhava - deity) tokaya (represent a new born, child, wild boar) tanayaya (daughter) sam (together) yoh (they)"},
    
    {"tip": "1.189.3", "body": "अग्ने त्वमस्मद युयोध्यमीवा अनग्नित्रा अभ्यमन्त कृष्टीः । पुनरस्मभ्यं सुविताय देव क्षां विश्वेभिरमृतेभिर्यजत्र ॥ "},
    {"tip": "Transliteration", "body": "agne tvam asmat yuyodhi amivah anagni-a-trah abhi amanta krstih; punah asmabhyam suvitaya deva ksam visvebhih amrtebhi yajatra."},
    {"tip": "Translation", "body": "Fire, my maladies need your cure; Help the fight against those hostile, they who despise; Help us in an effortless return to the earth, with the immortal gods, O master of sacrifice "},
    {"tip": "Word by word", "body": "agne (agni) tvam (you) asmat (asmad - I) yuyodhi (yuyodhi - remove, detach) amivah (disease, affliction) anagni-a-trah (anagni - having no fire) (tra - protecting, three) abhi (go over, near) amanta (not using vedic verses) krstih (ploughing); punah (purifying) asmabhyam (also that) suvitaya (great wealth) deva (deva - deity) ksam (patiently) visvebhih (worldly) amrtebhi (immortals) yajatra (worthy of worship)"},

    {"tip": "1.189.4", "body": "पाहि नो अग्ने पायुभिरजस्रैरुत प्रिये सदन आ शुशुक्वान । मा ते भयं जरितारं यविष्ठ नूनं विदन मापरं सहस्वः ॥ "},
    {"tip": "Transliteration", "body": "pahi no agne payu-a-bhih ajasrai uta priye sadane aa susukvan; ma te bhayam jaritaram yavistha nunam vidat ma aparam sahasvah."},
    {"tip": "Translation", "body": "Defend us unceasing; Forever shine within; Young fire, let no fear rush your singer today; Mighty fire, let it never beset him again"},
    {"tip": "Word by word", "body": "pahi (please drink) nah (us) agne (agni) payu-a-bhih ajasrai uta (payu - protector of intimidation, perpetually) priye (beloved) sadane (seat) aa () susukvan (brilliant); ma (I) te (you) bhayam (fear) jaritaram (decayed, old) yavistha (very young) nunam (indeed) vidat (deal) ma aparam (deviation) sahasvah (mighty)"},

    {"tip": "1.189.5", "body": "मा नो अग्नेऽव सृजो अघायाविष्यवे रिपवे दुच्छुनायै । मादत्वते दशते मादते नो मा रीषते सहसावन परा दाः ॥"},
    {"tip": "Transliteration", "body": "ma no agne ava srjah aghaya avisyave ripave duchunayai; ma datvate dasate ma adate nah ma risate sahasa-a-van para dah"},
    {"tip": "Translation", "body": "Fire, protect us from evil, beasts and reptiles, from voracious, malefic fates; Mighty fire, Protect us from harm n' disgrace"},
    {"tip": "Word by word", "body": "ma (me) nah (us) agne ava (agni) srjah (root word srj - release, fall, cast) aghaya avisyave (malice) ripave (rip - deceit) duchunayai (wishing harm); ma (me) datvate (with teeth) dasate (ten) ma adate (out of illusion) nah (us) ma (me) risate (pluck) sahasa-a-van (mighty, strong) para (another) dah (burn)"},

    {"tip": "1.189.6", "body": "वि घ तवावाँ ऋतजात यंसद गर्णानो अग्ने तन्वे वरूथम । विश्वाद रिरिक्षोरुत वा निनित्सोरभिह्रुतामसि हि देव विष्पट ॥ "},
    {"tip": "Translation", "body": "Flame, the singer wearing your armor is an equal; Fire, you were born of truth; The singer is free from those who injure and scorn; You challenge the cheaters so uncouth"},
    {"tip": "Word by word", "body": "vi (arrangement) gha (going / singing) tva-a-van (worthy of you) rta-a-jat (well made, proper) yamsat (delayed) grnanah (fuel) agne (agni) tanve (parts of the body) varutham (coverings or ingredients of the body); visvat (earth) ririksoh uta (abandoning) va ninitsoh abhi-a-hrutam asi (wishing to blame) hi (verily) dev (deity) vispat (adversary)"},

    {"tip": "1.189.7", "body": "त्वां ताँ अग्न उभयान्वि विद्वान वेषि प्रपित्वे मनुषो यजत्र । अभिपित्वे मनवे शास्यो भूर्मर्मृजेन्य उशिग्भिर्नाक्रः ॥ "},
    {"tip": "Translation", "body": "Flame, how you set such groups apart; You contact the seeker at the right hour; Telling him what to do; Master of sacrifice, all pervading, you are"},
    {"tip": "Details", "body": "SAKSHI: [abhipitve, prapito:at the appropriate time;veshi:call, approach;ubhayah: two groups; those who do yajna and otherwise;shasyobhuh: instruct; ushigbhih: aspirant;manave:thinker;]"},
    {"tip": "Word by word", "body": "tvam (you) tan agne (body not killing) ubhayan vi (ubhya - who does the yajna) vidvan (intelligent) vesi (call, approach) pra-a-pitve (at the appropriate time) manusah (human) yajatra (deserving adoration); abhi-a-pitve (at the appropriate time) manve (thinker) sasyeh (command, control) bhuh marmrjenyah (sasyobhuh - instruct) usik-a-bhih (usibhih - aspirant) na akrah "},

    {"tip": "1.189.8", "body": "अवोचाम निवचनान्यस्मिन मानस्य सूनुः सहसाने अग्नौ । वयं सहस्रं रषिभिः सनेम विद्यामेषं वृजनं जीरदानुम ॥"},
    {"tip": "Translation", "body": "O fire, son of mantra, friendly knight; These spoken prayers, the secrets uncouple; With Rik mantras, every delight arrives in thousands; Wherein lies the urge to smash the hour of struggle"},
    {"tip": "Details", "body": "SAKSHI: [nivachanani: the words that speak out their secret sense, also in (4.3.16); rishibhih: illuminating rik mantra-sjira: swift in motion (3.3.6); vrjanam: stability (1.91.21); manasya: son of mantra;]"},
    {"tip": "Word by word", "body": "avocam (recite, declare) ni-a-vacanani asmin (nivachanani: the words that speak out their secret sense) manasya (son of mantra) sunuh (prepare) sahasane (sitting together) agneu (near agni); vayam (vayu) sahasram (sahasra - innumerable) rsi-a-bhih (illuminating the rik mantras) sanema (complete) vidyam isam (learning sheep/ram) brijanam (stability) jir-a-danum (jir - swift in motion)"}

]}
