{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 3", "body": "Rishi Madhuchandaa Mantra on Indra recited in Gayatri meter. "},
    {"tip": "Sanskrit", "body": "प्रथमं मण्डलमं, अनु १, ३ सूक्तम् ऋषि मधुच्छन्दा वैश्वामित्रः छन्द: गायत्री इन्द्र देव"},
    {"tip": "Mantra 1.3.1 - 1.3.12", "body": ""},
    {"tip": "1.3.1", "body": "अश्विना यज्वरीरिषो द्रवत्पाणी शुभस्पती । पुरुभुजा चनस्यतम ॥"},
    {"tip": "1.3.2", "body": "अश्विना पुरुदंससा नरा शवीरया धिया । धिष्ण्या वनतं गिरः ॥ "},
    {"tip": "1.3.3", "body": "दस्रा युवाकवः सुता नासत्या वृक्तबर्हिषः ।आ यातं रुद्रवर्तनी ॥ "},
    {"tip": "1.3.4", "body": "इन्द्रा याहि चित्रभानो सुता इमे त्वायवः । अण्वीभिस्तना पूतासः ॥ "},
    {"tip": "1.3.5", "body": "इन्द्रा याहि धियेषितो विप्रजूतः सुतावतः । उप ब्रह्माणि वाघतः ॥"},
    {"tip": "1.3.6", "body": "इन्द्रा याहि तूतुजान उप ब्रह्माणि हरिवः । सुते दधिष्व नश्चनः ॥ "},
    {"tip": "1.3.7", "body": "ओमासश्चर्षणीधृतो विश्वे देवास आगत । दाश्वांसो दाशुषः सुतम ॥ "},
    {"tip": "1.3.8", "body": "विश्वे देवासो अप्तुरः सुतमा गन्त तूर्णयः । उस्रा इव स्वसराणि ॥ "},
    {"tip": "1.3.9", "body": "विश्वे देवासो अस्रिध एहिमायासो अद्रुहः ।मेधं जुषन्त वह्नयः ॥ "},
    {"tip": "1.3.10", "body": "पावका नः सरस्वती वाजेभिर्वाजिनीवती ।यज्ञं वष्टु धियावसुः ॥ "},
    {"tip": "1.3.11", "body": "चोदयित्री सूनृतानां चेतन्ती सुमतीनाम । यज्ञं दधे सरस्वती ॥ "},
    {"tip": "1.3.12", "body": "महो अर्णः सरस्वती प्र चेतयति केतुना । धियो विश्वा वि राजति ॥"},
    {"tip": "Translation", "body": ""},
    {"tip": "1.3.1", "body": "Asvins carry on the sacrifice, enjoy it rich; Euphoric lords, their moves, so swift; The energies urge, Their delights lift. "},
    {"tip": "1.3.2", "body": "Asvins, O leaders; Start the action; Firm, brilliant and intelligent, O advocates. My words, may they bring you satisfaction. "},
    {"tip": "1.3.3", "body": "Your action, we wish. We prime the Potent Soma. O powers of speed, Take your seat; to our sacrifice, come swift; Pure turns matter, you help it proceed."},
    {"tip": "1.3.4", "body": "Come, O Indra, bequeathed you are in lights, So many of us return to this Soma wine; This index of wonder, desires a sip; Race to the Soma pleasant and benign. Beyond ordinary stretched, the Subtle powers entwine."},
    {"tip": "1.3.5", "body": "Thoughts, aggravated; Illumined scholars, their urge; Come to my chants, deliberated; come to this singer, this medicine-man’s church;"},
    {"tip": "1.3.6", "body": "Indra, gallop on your steeds, with power; My praises beseech you; Grasp firm for us in Soma - this enchanted hour"},
    {"tip": "1.3.7", "body": "Come here, all ye Gods; Fosterers - the pursuers, you endorse; In diligence, you apportion the Soma; Prepared by the giver, vital force"}, 
    {"tip": "1.3.8", "body": "Ye gods, who pour the waters; To my Soma offering, hasten; Just the way the cows to their resting place, rush in"},
    {"tip": "1.3.9", "body": "All ye Gods, we know, you don’t blunder; Harmless you are; Enjoy, uphold this sacrifice, free as knowledge, you travel far"},
    {"tip": "1.3.10", "body": "Cathartic Sarasvati, you long for a sacrifice; Riches, there are, abundant; Festooned they are, by ornate thoughts; Will you espouse this sacrificial moment?"},
    {"tip": "1.3.11", "body": "She stamps the moment; Stamps it with truth so propitious; All happy thoughts awaken; Sarasvati upholds the sacrifice"},
    {"tip": "1.3.12", "body": "Avalanches led by Sarasvati; Truth is the great flood; Revelation felt in the consciousness; Illumined is the thought "},
    {"tip": "Word by word", "body": ""},
    {"tip": "1.3.1", "body": "ashvina (ashvin) yajvarih (Yajna execution) isah (impelling energies) dravatpani (dravat - speed, apani - himself) (Sayana: iti dravat-a-pani) subhah (subhas - evening) pati (lords of weal, of bliss) iti (is); puru-a-bhuja (puru - many; abhuja - enjoyed) chanasyatam (purubhuja - much enjoying, take delight; asyatam - sit down)"},
    {"tip": "1.3.2", "body": "ashvina (ashvin) puru-a-damsasa (pur - abundant; damsa - action) nara (heroes) saviraya (swift gait) dhiya (of the mind); dhisnya (transcendental, master of knowledge) vanatam (from the forests) girah (by words)"},
    {"tip": "1.3.3", "body": "dasra (of ashvini) yuvakavah (vigorous) sutah (soma) nasatya (of movement) vrikta-a-barhisah (bariish - seat of Yajna; vrikta - to empty); aa yatam (yatad - this one) rudravartani (Sayan: rudrasabdasya rodanam) (act of purification - silver or gold becomes purified)"},
    {"tip": "1.3.4", "body": "indra (indra) aa yahi (please return) citrabhano (Sayana iti chitra-a-bhano) (chitra - wonderful; bhano - manifestation) (chit - root - undertand) sutah (of soma) ime (all these) tva-a-yavah (tvayavah: desiring you); anvibhi (Sayan anvibhi root anvay - follow, race) tana (anvi: subtle, small; abhi towards; tana - all) putasah (puta - pure)"},
    {"tip": "1.3.5", "body": "indra (indra) aa yahi (please return) dhiya (of minds) asitah (desired) vipr-a-jutah (Vipra: illumined thinker) (Sayan - well studied) suta-a-vatah (soma song or singer); upa (near) brahmani (word) vaghatah (lauder, expresses his soul thoughts in the form of vak, the potent speech)"},
    {"tip": "1.3.6", "body": "indra (indra) aa yahi (go) tutujanah (sayan makes a reference to Kanjadesh) (tutubhe - to hit) upa (near) brahmani (word recital) hari-a-vah (indra’s steeds); sutey (soma based) dadhisva (dadhi - of the cow, yogurt) nah (our) chanah (chanah - delight)"},
    {"tip": "1.3.7", "body": "omasah (Sayan - avanti iti omas deva - endless) charsani-a-dhritah (charsani - disloyal; adhrita - restless) visvey (global) devasah (all ye gods) aa gata (arrived); dasvamsah (tenth division) dasusah (who serves the gods) sutam (soma)"},
    {"tip": "1.3.8", "body": "visve (dropped) devasah (all ye gods) apa-a-turah (apturah - givers of waters) sutam (soma) aa ganta (newcomer) turnayah (quickly); usrah-a-iva (usrah - surya luminescence as well) svasarani (ones own place)"},
    {"tip": "1.3.9", "body": "visve (all) devasah (deity) asridhah (not falling) ehi-a-mayasah (ehimayasah: endowed) adruhah (adruhah: without treachery); medham (essence, offering) jusant (overtaken by) vahnayah (carrying, conveying)"},
    {"tip": "1.3.10", "body": "pavaka (pavaka - pure, bright) nah (our) sarasvati (Sarasvati) vajebhih vajini-a-vati (vajini - of horses); yajnam (sacrifice) vastu (object) dhiya-a-vasuh (dhiya - attentive)(vasu - ray of light)"},
    {"tip": "1.3.11", "body": "chodayitri (chod - animating, inspiring) sunritanam (sunrtanam: speech that is both pleasant and true) chetanti (full of consciousness) su-a-matinam (su - begetting + matinam - intelligence; mati - of the brain); yajnam (Yajna - sacrifice) dadhey (dadhai - notice, meditate) (dadhey - advance) sarasvati (Sarasvati)"},
    {"tip": "1.3.12", "body": "mahah (mighty) arnah (flood) sarasvati (Sarasvati) pra chetayati (to awaken) ketuna (ketu - smoke); dhiyah (dhiya - of mind) visvah (universal) vi (purified) rajati (rajati - shine like silver)"}
]}
