{"data":[
    {"tip": "Rig Veda, Book 1, Chapter 1", 
    "body": "Rishi Madhuchchhandah Vaishvamitrah's Mantra on Agni recited in Gayatri Chhand meter. "},
    {"tip": "Sanskrit", "body": "प्रथमं मण्डलमं, अनु १, प्रथमं सूक्तम् ऋषि मधुच्छन्दा वैश्वामित्रः छन्द: गायत्री अग्निः देव"},
    {"tip": "Mantra 1.1.8", "body": "राजन्तमध्वराणां गोपां रतस्य दीदिविम । वर्धमानं स्वे दमे ॥"},
    {"tip": "Transliteration", "body": "rajantam-adhvaranam gopam ritasya didivim; vardhamanam sve damey"},
    {"tip": "Translation", "body": "Agni rules the pilgrim-yajna-s as its sovereign (1), he is the luminous guardian of Truth (2). His power of manifestation ever increases in his own home (3)."},
    {"tip": "Word by word", "body": "rajantam (king, reign) adhvaranam (Aurobindo - pilgrimage; Sayan - rasa) gopam (rays of light, protector of light) ritasya (right truth, truth in manifestation) didivim (of intelligence) vardhamanam (increasing) sve dame (Agni’s own home)"},
    {"tip": "Description", "body": "This mantra affirms the association between Agni and Truth mentioned earlier in mantra-s Rig Veda (1.1.5) and Rig Veda (1.1.6). *sve damey*: Agni's own Home. It is not the altar of the ritual fire as the ritualists and the moderns claim. Agni's abode is characterized in Rig Veda (1.75.5) and other verses of Rig Veda, and also in Atharva Veda (12.1.1) by three phrases: Absolute Truth (satyam), Truth-in-action, Right (ritam) and Vast (brihat). Every aspect of manifestation in this universe and others are characterized by a truth, all of which are included in the Word ritam. This abode has absolutely no limitations of any sort, physical, psychological, etc. Hence, it is characterized as Vast. In this verse, Agni is described as the guardian of the Truth in manifestation. In Rig Veda (1.12.7), Agni is described as, *he whose law of being is Truth*, satyadharmanam. Wilson, following Sayanacharya, gives the following explanation for *sve damey* as the chamber in which the fire worship is performed and in which the fire increases by the oblations poured upon it. *ritam*: Truth-in-action, Truth-in-movement. ritam is the Truth in manifestation, the projection of the Truth-in-Being (satya) into the plane of becoming, the plane of time and space. It is the Truth of the divine being from seeing, hearing and any conscious action without falsehood. This word occurs more than 500 times. Ritam is sometimes mistranslated as the *lower Truth*. In Veda, both satya and ritam have equal weight. ritam has gone out of currency in the post-vedic literature. *vardhamanam*: increasing. Agni is described as increasing in his own home. Clearly the physical flame cannot increase forever, even by consuming all the ghee. The phrase *Agni increasing in his own home* implies that Agni's power, both physical and psychological, increases in all aspects of manifestation including human beings. *rajantam*: king. By means of the path (adhvara) of the yajna, Agni takes the human aspirant to the home of Truth, the plane of the Vast. Thus, Agni is described as the king of these paths. Agni himself carries out the sacrifice or yajna because he wants to establish the supreme Truth in the *yajamana*."}
]}
